"""
Пользователь вводит строку из нескольких слов, разделённых пробелами.
Вывести каждое слово с новой строки. Строки необходимо пронумеровать.
Если в слово длинное, выводить только первые 10 букв в слове.
"""

input_str = input("Enter any text you like:\n>>>")
temp_arr = input_str.split(" ")

for i in temp_arr:
    print(f'{temp_arr.index(i) + 1}: {i[:10].center(10)}')
