"""
Даны матрицы n на m
Матрица олицетворяет улицу, колонки в Матрице олицетворяют Здания. 1 в колонке означает наличие этажа, 0 его отсутвие
Написать алгоритм нахождения самого высокого здания на улице. результат сохранить в переменную в виде кортежа или
списка [номер колонки, количество этажей]
"""

street = [[0, 0, 1, 0],
          [0, 0, 1, 1],
          [0, 1, 1, 1],
          [1, 1, 1, 1]]

result = ()

for idx, i in enumerate(zip(*street), 1):
    height = sum(i)
    if idx == 1 or result[1] < height:
        result = (idx, height)

print(result)
