""" 3
На вход функции подается строка, вернуть булевое является эта строка полиндромом или нет
проверочная строка "Пал, а норов худ и дух ворона лап."
Полиндром это строка которая читается в обе стороны одинаково, при этом знаки препинания числа и непечатные символы
игнорируются
"""


def palindrome(text):
    cleared_text = ("".join(i for i in text if i.isalpha())).lower()

    return cleared_text == cleared_text[::-1]


some_string = "Пал, а норов худ и дух ворона лап."
print(palindrome(some_string))
