""" 1
Реализовать функцию, принимающую несколько параметров,
описывающих данные пользователя:
имя, фамилия, год рождения, город проживания, email, телефон.
Результатом работы функции должна быть строка
Пример строки результата:
Иванов Иван Иванович 1986 года Рождения, проживающий в городе Норильск.
Контактные данные:
- телефон: 89181111111
- email: test@test.ru
"""


def user(name, surname, birthdate, city, email, phone):
    result = f'{surname} {name} {birthdate} года рождения, проживающий в городе {city}\n' \
             f'Контактные данные:\n-' \
             f' телефон: {phone}\n' \
             f'- email: {email}'
    return result


print(user(name="Петя", surname="Козлов", birthdate="1999", city="Минск",
           email="test@test.com", phone="89181111111"))
